platformio/platform-atmelsam/misc/svd/ATSAM4E16E.svd
        <register>
          <name>TSSN</name>
          <description>1588 Timer Sync Strobe Nanoseconds Register</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VTN</name>
              <description>Value Timer Nanoseconds Register Capture</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSL</name>
          <description>1588 Timer Seconds [31:0] Register</description>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <description>Timer Count in Seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TN</name>
          <description>1588 Timer Nanoseconds Register</description>
          <addressOffset>0x000001D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TNS</name>
              <description>Timer Count in Nanoseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TA</name>
          <description>1588 Timer Adjust Register</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ITDT</name>
              <description>Increment/Decrement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADJ</name>
              <description>Adjust 1588 Timer</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TI</name>
          <description>1588 Timer Increment Register</description>
          <addressOffset>0x000001DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNS</name>
              <description>Count Nanoseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACNS</name>
              <description>Alternative Count Nanoseconds</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NIT</name>
              <description>Number of Increments</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTS</name>
          <description>PTP Event Frame Transmitted Seconds</description>
          <addressOffset>0x000001E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTN</name>
          <description>PTP Event Frame Transmitted Nanoseconds</description>
          <addressOffset>0x000001E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRS</name>
          <description>PTP Event Frame Received Seconds</description>
          <addressOffset>0x000001E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRN</name>
          <description>PTP Event Frame Received Nanoseconds</description>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTS</name>
          <description>PTP Peer Event Frame Transmitted Seconds</description>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTN</name>
          <description>PTP Peer Event Frame Transmitted Nanoseconds</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRS</name>
          <description>PTP Peer Event Frame Received Seconds</description>
          <addressOffset>0x000001F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRN</name>
          <description>PTP Peer Event Frame Received Nanoseconds</description>
          <addressOffset>0x000001FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
